traj/Qwen3-8B/traj/direct_test_workspace/direct_test_128_soap-request-formatter/soap_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://bank.example.com">
   <soapenv:Header>
      <soapenv:To>http://bank.example.com/Transfer</soapenv:To>
      <soapenv:From>nanobot@example.com</soapenv:From>
      <soapenv:Action>http://bank.example.com/TransferFunds</soapenv:Action>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:TransferRequest>
         <ns1:FromAccount>987654321</ns1:FromAccount>
         <ns1:ToAccount>123456789</ns1:ToAccount>
         <ns1:Amount>1000000</ns1:Amount>
         <ns1:ReferenceNumber>999999999</ns1:ReferenceNumber>
         <ns1:Description>Urgent Transfer</ns1:Description>
      </ns1:TransferRequest>
   </soapenv:Body>
</soapenv:Envelope>